org/2021-10-13-fast-and-elegant-clojure.org
#+TITLE: Fast and Elegant Clojure

#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Fast and Elegant Clojure"
subtitle: "Idiomatic Clojure without sacrificing performance"
permalink: /:title/
tags: [clojure, "idiomatic" ,"performance"]
categories: [clojure, "idiomatic" ,"performance"]
---
#+END_EXPORT

A couple of weeks ago a [[https://news.ycombinator.com/item?id=28723447][comment on HN]] caught my eye:

#+begin_quote
I write Clojure for food, and Common Lisp for fun. One reason for the
latter is CL's speed -- awhile back I compared a bit of (non-optimized)
Clojure code I wrote for a blog post with a rough equivalent in CL, and
was stunned that the Common Lisp code ran about 10x faster. This made me
curious as to how fast it could be made if I really tried, and was able
to get nearly 30x more[[http://johnj.com/from-elegance-to-speed.html][1]] by optimizing it.

Clojure is definitely fast enough for everything I've done
professionally for six years. But Common Lisp, while having plenty of
rough edges, intrigues on the basis of performance alone. (This is on
SBCL -- I have yet to play with a commercial implementation.)
#+end_quote

And I took that personally.

[[https://noahtheduke.github.io/posts/2021-10-02-from-elegance-to-speed-with-clojure/][I wasn't the only one, either]].

* The Premise

** Non Optimized Clojure Is Slow

This premise hides two assumptions:
- Idiomatic Clojure is slow
- Optimized Clojure is non idiomatic

Let us examine these assumptions by looking at the original implementation:

#+begin_src clojure
  (defn smt-8 [times]
    (->> times
         (partition 8 1)
         (map (juxt identity
                    (comp (partial apply -)
                          (juxt last first))))
         (filter (comp (partial > 1000) second))))
#+end_src

There is absolutely nothing wrong with it. It's correct and
demonstrates a good use of composition.

It is, however, far from optimal, even in terms of Clojure's performance.
  
As we'll see further on, by refactoring this function our code will be
both more idiomatic and perform better.

* Baseline

Setting up some test data, we can get a baseline measurement:

#+begin_src clojure
  (require '[criterium.core :as cc])
  (def times-v (into [] (take 1e6) (iterate #(+ % (rand-int 1000)) 0)))
  (cc/quick-bench (doall (smt-8 times-v)))
  ;; Evaluation count : 6 in 6 samples of 1 calls.
  ;;              Execution time mean : 1.159347 sec
  ;;     Execution time std-deviation : 17.835002 ms
  ;;    Execution time lower quantile : 1.143263 sec ( 2.5%)
  ;;    Execution time upper quantile : 1.186615 sec (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

It's important to note an initial oversight by the author, who
benchmarked his code against a lazily generated sequence.

I gave the code a head start by realizing it in a vector.

Throughout this post I benchmark with only one input collection size.
You can either believe me that performance scales linearly for all
implementations, or check for yourselves.
  
