_posts/2021-10-13-fast-and-elegant-clojure.html
---
layout: post
title: "Fast and Elegant Clojure"
subtitle: "Idiomatic Clojure without sacrificing performance"
permalink: /:title/
tags: [clojure, "idiomatic" ,"performance"]
categories: [clojure, "idiomatic" ,"performance"]
---

<p>
A couple of weeks ago a <a href="https://news.ycombinator.com/item?id=28723447">comment on HN</a> caught my eye:
</p>

<blockquote>
<p>
I write Clojure for food, and Common Lisp for fun. One reason for the
latter is CL's speed &#x2013; awhile back I compared a bit of (non-optimized)
Clojure code I wrote for a blog post with a rough equivalent in CL, and
was stunned that the Common Lisp code ran about 10x faster. This made me
curious as to how fast it could be made if I really tried, and was able
to get nearly 30x more<a href="http://johnj.com/from-elegance-to-speed.html">1</a> by optimizing it.
</p>

<p>
Clojure is definitely fast enough for everything I've done
professionally for six years. But Common Lisp, while having plenty of
rough edges, intrigues on the basis of performance alone. (This is on
SBCL &#x2013; I have yet to play with a commercial implementation.)
</p>
</blockquote>

<p>
And I took that personally.
</p>

<p>
<a href="https://noahtheduke.github.io/posts/2021-10-02-from-elegance-to-speed-with-clojure/">I wasn't the only one, either</a>.
</p>

<div id="outline-container-org73465a9" class="outline-2">
<h2 id="org73465a9">The Premise</h2>
<div class="outline-text-2" id="text-org73465a9">
</div>
<div id="outline-container-org7a75755" class="outline-3">
<h3 id="org7a75755">Non Optimized Clojure Is Slow</h3>
<div class="outline-text-3" id="text-org7a75755">
<p>
This premise hides two assumptions:
</p>
<ul class="org-ul">
<li>Idiomatic Clojure is slow</li>
<li>Optimized Clojure is non idiomatic</li>
</ul>

<p>
Let us examine these assumptions by looking at the original implementation:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">smt-8</span> <span style="color: #6c3163;">[</span>times<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;&gt;</span> times
       <span style="color: #2d9574;">(</span>partition <span style="color: #4e3163;">8</span> <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>map <span style="color: #67b11d;">(</span>juxt identity
                  <span style="color: #b1951d;">(</span>comp <span style="color: #3a81c3;">(</span>partial apply -<span style="color: #3a81c3;">)</span>
                        <span style="color: #3a81c3;">(</span>juxt last first<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>filter <span style="color: #67b11d;">(</span>comp <span style="color: #b1951d;">(</span>partial &gt; <span style="color: #4e3163;">1000</span><span style="color: #b1951d;">)</span> second<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
There is absolutely nothing wrong with it. It's correct and
demonstrates a good use of composition.
</p>

<p>
It is, however, far from optimal, even in terms of Clojure's performance.
</p>

<p>
As we'll see further on, by refactoring this function our code will be
both more idiomatic and perform better.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf4d7e28" class="outline-2">
<h2 id="orgf4d7e28">Baseline</h2>
<div class="outline-text-2" id="text-orgf4d7e28">
<p>
Setting up some test data, we can get a baseline measurement:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>require '<span style="color: #6c3163;">[</span>criterium.core <span style="color: #4e3163;">:as</span> cc<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">times-v</span> <span style="color: #6c3163;">(</span>into <span style="color: #2d9574;">[]</span> <span style="color: #2d9574;">(</span>take <span style="color: #4e3163;">1e6</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>iterate #<span style="color: #67b11d;">(</span>+ <span style="color: #715ab1;">%</span> <span style="color: #b1951d;">(</span>rand-int <span style="color: #4e3163;">1000</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #4e3163;">0</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doall</span> <span style="color: #2d9574;">(</span>smt-8 times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 6 in 6 samples of 1 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 1.159347 sec</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 17.835002 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 1.143263 sec ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 1.186615 sec (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.066166 ns</span>
</pre>
</div>

<p>
It's important to note an initial oversight by the author, who
benchmarked his code against a lazily generated sequence.
</p>

<p>
I gave the code a head start by realizing it in a vector.
</p>

<p>
Throughout this post I benchmark with only one input collection size.
You can either believe me that performance scales linearly for all
implementations, or check for yourselves.
</p>
</div>
</div>
