_posts/2021-10-13-fast-and-elegant-clojure.html

<div id="outline-container-org2e4f049" class="outline-2">
<h2 id="org2e4f049">First Step - the missing transducer</h2>
<div class="outline-text-2" id="text-org2e4f049">
<p>
This use case is perfect for transducers. They were written exactly
for a series of sequence transformations:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;&gt;</span> xs
     <span style="color: #6c3163;">(</span>map f<span style="color: #6c3163;">)</span>
     <span style="color: #6c3163;">(</span>filter g<span style="color: #6c3163;">)</span>
     <span style="color: #6c3163;">(</span>map h<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">is equivalent to =&gt;</span>
<span style="color: #3a81c3;">(</span>sequence
 <span style="color: #6c3163;">(</span>comp
  <span style="color: #2d9574;">(</span>map f<span style="color: #2d9574;">)</span>
  <span style="color: #2d9574;">(</span>filter g<span style="color: #2d9574;">)</span>
  <span style="color: #2d9574;">(</span>map h<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
 xs<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
With the added bonus of removing intermediary allocations. That's
pretty neat. The only problem is we're missing a crucial component.
There is no transducer equivalent to <code>(partition n step coll)</code>.
</p>

<p>
Are we doomed? Not quite.
</p>

<p>
There is a close transducer, <code>partition-all</code>, which has no step
arity. Let's look at how it's implemented:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">partition-all</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> n<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span>rf<span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #b1951d;">[</span>a <span style="color: #3a81c3;">(</span>java.util.ArrayList. n<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span>
       <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[]</span> <span style="color: #6c3163;">(</span>rf<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result<span style="color: #6c3163;">]</span>
          <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>result <span style="color: #887070;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>.isEmpty a<span style="color: #3a81c3;">)</span>
                         result
                         <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>v <span style="color: #2d9574;">(</span>vec <span style="color: #67b11d;">(</span>.toArray a<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
                           <span style="color: #2aa1ae; background-color: #ecf3ec;">;;</span><span style="color: #2aa1ae; background-color: #ecf3ec;">clear first!</span>
                           <span style="color: #6c3163;">(</span>.clear a<span style="color: #6c3163;">)</span>
                           <span style="color: #6c3163;">(</span>unreduced <span style="color: #2d9574;">(</span>rf result v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #887070;">)</span><span style="color: #2d9574;">]</span>
            <span style="color: #2d9574;">(</span>rf result<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result input<span style="color: #6c3163;">]</span>
          <span style="color: #6c3163;">(</span>.add a input<span style="color: #6c3163;">)</span>
          <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>= n <span style="color: #887070;">(</span>.size a<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #887070;">[</span>v <span style="color: #3a81c3;">(</span>vec <span style="color: #6c3163;">(</span>.toArray a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #887070;">]</span>
              <span style="color: #887070;">(</span>.clear a<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>rf result v<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
If we wanted a sliding window, all we have to do was replace the
ArrayList with a Queue!
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">sliding</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> n<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>sliding n <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> n <span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> step<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span>rf<span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #b1951d;">[</span>a <span style="color: #3a81c3;">(</span>java.util.ArrayDeque. n<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Queue here</span>
       <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[]</span> <span style="color: #6c3163;">(</span>rf<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>rf result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">don't need leftovers</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result input<span style="color: #6c3163;">]</span>
          <span style="color: #6c3163;">(</span>.add a input<span style="color: #6c3163;">)</span>
          <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>= n <span style="color: #887070;">(</span>.size a<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #887070;">[</span>v <span style="color: #3a81c3;">(</span>vec <span style="color: #6c3163;">(</span>.toArray a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #887070;">]</span>
              <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Remove `</span><span style="color: #4e3163; background-color: #ecf3ec;">step</span><span style="color: #2aa1ae; background-color: #ecf3ec;">` elements instead of clear</span>
              <span style="color: #887070;">(</span><span style="color: #3a81c3; font-weight: bold;">dotimes</span> <span style="color: #3a81c3;">[</span>_ step<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span>.removeFirst a<span style="color: #3a81c3;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>rf result v<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Let's convinces ourselves it works:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>sequence <span style="color: #6c3163;">(</span>sliding <span style="color: #4e3163;">3</span> <span style="color: #4e3163;">1</span><span style="color: #6c3163;">)</span> '<span style="color: #6c3163;">[</span>a b c d e<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; ([a b c] [b c d] [c d e])</span>
</pre>
</div>

<p>
Now we can define an equivalent transducer:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">baseline-xf</span>
  <span style="color: #6c3163;">(</span>comp
   <span style="color: #2d9574;">(</span>sliding <span style="color: #4e3163;">8</span> <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>map <span style="color: #67b11d;">(</span>juxt identity
              <span style="color: #b1951d;">(</span>comp <span style="color: #3a81c3;">(</span>partial apply -<span style="color: #3a81c3;">)</span>
                    <span style="color: #3a81c3;">(</span>juxt last first<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>filter <span style="color: #67b11d;">(</span>comp <span style="color: #b1951d;">(</span>partial &gt; <span style="color: #4e3163;">1000</span><span style="color: #b1951d;">)</span> second<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doall</span> <span style="color: #2d9574;">(</span>sequence baseline-xf times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 6 in 6 samples of 1 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 462.921956 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 20.213288 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 453.931650 ms ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 497.963799 ms (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.079753 ns</span>
</pre>
</div>

<p>
And we're already ~2.5x faster
</p>
</div>
</div>
