org/2021-10-13-fast-and-elegant-clojure.org
* De-composing

How much overhead is there to all this functional composition? Let's
find out:

#+begin_src clojure
  (def decomposed-xf
    (comp
     (sliding 8 1)
     (map (fn [v] [v (- (last v) (first v))]))
     (filter (fn [[_ t]] (> 1000 t)))))

  (= (sequence decomposed-xf times-v) (smt-8 times-v)) ;; => true
  (cc/quick-bench (doall (sequence decomposed-xf times-v)))
  ;; Evaluation count : 6 in 6 samples of 1 calls.
  ;;              Execution time mean : 366.650954 ms
  ;;     Execution time std-deviation : 2.112047 ms
  ;;    Execution time lower quantile : 365.042052 ms ( 2.5%)
  ;;    Execution time upper quantile : 370.254096 ms (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

25% faster? How come? The culprit is mainly ~apply~. ~juxt~ returns a
vector of two elements and apply takes it back apart, one element at a
time. Iteration has its price.

* Faster vector operations

~first~ and ~last~ will work on pretty much everything, including Java
arrays. It does not mean, however, it is a good idea.
Vectors can be accessed faster using indexed access.

Since our last vector won't have 8 elements, we can generically get the
last element by using peek. Looking at its docstring:
#+begin_quote
For a list or queue, same as first, for a vector, same as, but much
more efficient than, last. If the collection is empty, returns nil.
#+end_quote

#+begin_src clojure
  (def vector-xf
    (comp
     (sliding 8 1)
     (map (fn [v] [v (- (peek v) (nth v 0))]))
     (filter (fn [[_ t]] (> 1000 t)))))

  (= (sequence decomposed-xf times-v) (sequence vector-xf times-v)) ;; => true
  (cc/quick-bench (doall (sequence vector-xf times-v)))
  ;; Evaluation count : 12 in 6 samples of 2 calls.
  ;;              Execution time mean : 88.566441 ms
  ;;     Execution time std-deviation : 350.326432 µs
  ;;    Execution time lower quantile : 88.235538 ms ( 2.5%)
  ;;    Execution time upper quantile : 89.062221 ms (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

Now we're beginning to see some dramatic improvements. It is mostly due
to the overhead of ~last~, which *always* iterates over the input
collection, and does not even take the most efficient code paths to do
so.

