_posts/2021-10-13-fast-and-elegant-clojure.html

<div id="outline-container-org1b51859" class="outline-2">
<h2 id="org1b51859">De-composing</h2>
<div class="outline-text-2" id="text-org1b51859">
<p>
How much overhead is there to all this functional composition? Let's
find out:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">decomposed-xf</span>
  <span style="color: #6c3163;">(</span>comp
   <span style="color: #2d9574;">(</span>sliding <span style="color: #4e3163;">8</span> <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>map <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[</span>v<span style="color: #b1951d;">]</span> <span style="color: #b1951d;">[</span>v <span style="color: #3a81c3;">(</span>- <span style="color: #6c3163;">(</span>last v<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>first v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>filter <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[</span><span style="color: #3a81c3;">[</span>_ t<span style="color: #3a81c3;">]</span><span style="color: #b1951d;">]</span> <span style="color: #b1951d;">(</span>&gt; <span style="color: #4e3163;">1000</span> t<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>= <span style="color: #6c3163;">(</span>sequence decomposed-xf times-v<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>smt-8 times-v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; true</span>
<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doall</span> <span style="color: #2d9574;">(</span>sequence decomposed-xf times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 6 in 6 samples of 1 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 366.650954 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 2.112047 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 365.042052 ms ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 370.254096 ms (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.066166 ns</span>
</pre>
</div>

<p>
25% faster? How come? The culprit is mainly <code>apply</code>. <code>juxt</code> returns a
vector of two elements and apply takes it back apart, one element at a
time. Iteration has its price.
</p>
</div>
</div>

<div id="outline-container-org0b4e10a" class="outline-2">
<h2 id="org0b4e10a">Faster vector operations</h2>
<div class="outline-text-2" id="text-org0b4e10a">
<p>
<code>first</code> and <code>last</code> will work on pretty much everything, including Java
arrays. It does not mean, however, it is a good idea.
Vectors can be accessed faster using indexed access.
</p>

<p>
Since our last vector won't have 8 elements, we can generically get the
last element by using peek. Looking at its docstring:
</p>
<blockquote>
<p>
For a list or queue, same as first, for a vector, same as, but much
more efficient than, last. If the collection is empty, returns nil.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">vector-xf</span>
  <span style="color: #6c3163;">(</span>comp
   <span style="color: #2d9574;">(</span>sliding <span style="color: #4e3163;">8</span> <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>map <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[</span>v<span style="color: #b1951d;">]</span> <span style="color: #b1951d;">[</span>v <span style="color: #3a81c3;">(</span>- <span style="color: #6c3163;">(</span>peek v<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>nth v <span style="color: #4e3163;">0</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>filter <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[</span><span style="color: #3a81c3;">[</span>_ t<span style="color: #3a81c3;">]</span><span style="color: #b1951d;">]</span> <span style="color: #b1951d;">(</span>&gt; <span style="color: #4e3163;">1000</span> t<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>= <span style="color: #6c3163;">(</span>sequence decomposed-xf times-v<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>sequence vector-xf times-v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; true</span>
<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doall</span> <span style="color: #2d9574;">(</span>sequence vector-xf times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 12 in 6 samples of 2 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 88.566441 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 350.326432 &#181;s</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 88.235538 ms ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 89.062221 ms (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.066166 ns</span>
</pre>
</div>

<p>
Now we're beginning to see some dramatic improvements. It is mostly due
to the overhead of <code>last</code>, which <b>always</b> iterates over the input
collection, and does not even take the most efficient code paths to do
so.
</p>
</div>
</div>
