org/2021-10-13-fast-and-elegant-clojure.org
* Something between map and filter

Ideally, we would have liked to only allocate the vector in the ~map~
transducer if the condition in ~filter~ is satisfied. Can we? Enter ~keep~:

#+begin_quote
Returns a lazy sequence of the non-nil results of (f item). Note,
this means false return values will be included.  f must be free of
side-effects.  Returns a transducer when no collection is provided.
#+end_quote

Turns out, that's exactly what we needed. We can then discard the
difference calculation and not allocate another vector:

#+begin_src clojure
  (def keep-xf
    (comp
     (sliding 8 1)
     (keep (fn [v]
             (when (> 1000 (- (peek v) (nth v 0)))
               v)))))

  (= (sequence keep-xf times-v) (map first (sequence vector-xf times-v))) ;; => true
  (cc/quick-bench (doall (sequence keep-xf times-v)))
  ;; Evaluation count : 12 in 6 samples of 2 calls.
  ;;              Execution time mean : 80.411626 ms
  ;;     Execution time std-deviation : 1.211228 ms
  ;;    Execution time lower quantile : 79.822031 ms ( 2.5%)
  ;;    Execution time upper quantile : 82.508332 ms (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

Slightly faster. Since we know the inputs will always be ~long~, we can use unchecked maths:

#+begin_src clojure
  (set! *unchecked-math* true)
  (def unchecked-xf
    (comp
     (sliding 8 1)
     (keep (fn [v]
             (when (> 1000 (unchecked-subtract (long (peek v)) (long (nth v 0))))
               v)))))
  (set! *unchecked-math* false)

  (cc/quick-bench (doall (sequence unchecked-xf times-v)))
  ;; Evaluation count : 12 in 6 samples of 2 calls.
  ;;              Execution time mean : 66.642476 ms
  ;;     Execution time std-deviation : 356.808224 µs
  ;;    Execution time lower quantile : 66.323382 ms ( 2.5%)
  ;;    Execution time upper quantile : 67.047693 ms (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

Another 20%!

Up to this point, we can pat ourselves on the back and say our code is
still idiomatic on one hand, but performs way better on the other. About
15x faster, while non optimized CL was only 10x faster.

As an added bonus, this looks pretty idiomatic.

* Aside: wasn't the sliding transducer an optimization?

You could argue that it is. Or that it's a missing piece. It should
probably live in a library. I also don't think it was complicated to
derive, although transducers might be unwieldy for beginners.

Compare the initial snippet with the final version:

#+begin_src clojure
  (defn smt-8 [times]
    (->> times
         (partition 8 1)
         (map (juxt identity
                    (comp (partial apply -)
                          (juxt last first))))
         (filter (comp (partial > 1000) second))))

  (def keep-xf
    (comp
     (sliding 8 1)
     (keep (fn [v]
             (when (> 1000 (- (peek v) (nth v 0)))
               v)))))
#+end_src

I would consider the latter way more idiomatic /and/ concise.

