org/2021-10-13-fast-and-elegant-clojure.org
* Slightly less idiomatic

Do we have to get the results back as vectors? If we relax this
requirement, we can skip over wrapping the results in the sliding
transducer in a vector:

#+begin_src clojure
  (defn sliding-array
    ([^long n ^long step]
     (fn [rf]
       (let [a (java.util.ArrayDeque. n)]
         (fn
           ([] (rf))
           ([result] (rf result))
           ([result input]
            (.add a input)
            (if (= n (.size a))
              (let [v (.toArray a)]
                ;; Remove `step` elements instead of clear
                (dotimes [_ step] (.removeFirst a))
                (rf result v))
              result)))))))
#+end_src

Then, modify the argument to ~keep~ to take an array:

#+begin_src clojure
  (set! *unchecked-math* true)
  (def array-xf
    (comp
     (sliding-array 8 1)
     (keep (fn [^objects arr]
             (when (> 1000 (unchecked-subtract
                            (long (aget arr 7))
                            (long (aget arr 0))))
               arr)))))
  (set! *unchecked-math* false)
  (cc/quick-bench (doall (sequence array-xf times-v)))
  ;; Evaluation count : 30 in 6 samples of 5 calls.
  ;;              Execution time mean : 23.127029 ms
  ;;     Execution time std-deviation : 192.325091 µs
  ;;    Execution time lower quantile : 22.890029 ms ( 2.5%)
  ;;    Execution time upper quantile : 23.325306 ms (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

Another ~3x speedup, new 50x times faster than the original, without
going crazy with interop, optimization or some unrolling.

