_posts/2021-10-13-fast-and-elegant-clojure.html

<div id="outline-container-org01e4f54" class="outline-2">
<h2 id="org01e4f54">Slightly less idiomatic</h2>
<div class="outline-text-2" id="text-org01e4f54">
<p>
Do we have to get the results back as vectors? If we relax this
requirement, we can skip over wrapping the results in the sliding
transducer in a vector:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">sliding-array</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> n <span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">long</span> step<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span>rf<span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #b1951d;">[</span>a <span style="color: #3a81c3;">(</span>java.util.ArrayDeque. n<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span>
       <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[]</span> <span style="color: #6c3163;">(</span>rf<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>rf result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span>result input<span style="color: #6c3163;">]</span>
          <span style="color: #6c3163;">(</span>.add a input<span style="color: #6c3163;">)</span>
          <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>= n <span style="color: #887070;">(</span>.size a<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #887070;">[</span>v <span style="color: #3a81c3;">(</span>.toArray a<span style="color: #3a81c3;">)</span><span style="color: #887070;">]</span>
              <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Remove `</span><span style="color: #4e3163; background-color: #ecf3ec;">step</span><span style="color: #2aa1ae; background-color: #ecf3ec;">` elements instead of clear</span>
              <span style="color: #887070;">(</span><span style="color: #3a81c3; font-weight: bold;">dotimes</span> <span style="color: #3a81c3;">[</span>_ step<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span>.removeFirst a<span style="color: #3a81c3;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>rf result v<span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
            result<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Then, modify the argument to <code>keep</code> to take an array:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">set!</span> <span style="color: #3a81c3;">*unchecked-math*</span> <span style="color: #4e3163;">true</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">array-xf</span>
  <span style="color: #6c3163;">(</span>comp
   <span style="color: #2d9574;">(</span>sliding-array <span style="color: #4e3163;">8</span> <span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>keep <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #b1951d;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">objects</span> arr<span style="color: #b1951d;">]</span>
           <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #3a81c3;">(</span>&gt; <span style="color: #4e3163;">1000</span> <span style="color: #6c3163;">(</span>unchecked-subtract
                          <span style="color: #2d9574;">(</span>long <span style="color: #887070;">(</span>aget arr <span style="color: #4e3163;">7</span><span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
                          <span style="color: #2d9574;">(</span>long <span style="color: #887070;">(</span>aget arr <span style="color: #4e3163;">0</span><span style="color: #887070;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
             arr<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">set!</span> <span style="color: #3a81c3;">*unchecked-math*</span> <span style="color: #4e3163;">false</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doall</span> <span style="color: #2d9574;">(</span>sequence array-xf times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 30 in 6 samples of 5 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 23.127029 ms</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 192.325091 &#181;s</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 22.890029 ms ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 23.325306 ms (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.066166 ns</span>
</pre>
</div>

<p>
Another ~3x speedup, new 50x times faster than the original, without
going crazy with interop, optimization or some unrolling.
</p>
</div>
</div>
