org/2021-10-13-fast-and-elegant-clojure.org
* But can we go faster?

Let us put aside our requirement for idiomatic Clojure. Let's settle on readable.

By converting the input to an array, we can work directly with indices
and built up the results collection. We'll also take advantage of the
fact that linked lists are pretty fast to allocate, so build those
instead of a vector or set:

#+begin_src clojure
  (set! *unchecked-math* true)
  (defn unrolled
    [^longs arr]
    (let [l (unchecked-subtract (alength arr) 7)]
      (loop [idx (int 0) agg ()]
        (if (< idx l)
          (let [idx (int idx)]
            (recur
             (unchecked-inc-int idx)
             (if (> 1000 (unchecked-subtract (aget arr (unchecked-add-int idx 7)) (aget arr idx)))
               (.cons agg idx)
               agg)))
          agg))))
  (set! *unchecked-math* false)

  (let [arr (long-array times-v)]
    (cc/quick-bench (unrolled arr)))
  ;; Evaluation count : 912 in 6 samples of 152 calls.
  ;;              Execution time mean : 655.284194 µs
  ;;     Execution time std-deviation : 2.846323 µs
  ;;    Execution time lower quantile : 651.150750 µs ( 2.5%)
  ;;    Execution time upper quantile : 658.353038 µs (97.5%)
  ;;                    Overhead used : 2.066166 ns
#+end_src

Another 35x speedup!

This implementation is very different. It deals with a concrete array
instead of a sequence abstraction, and explicitly builds up the result.
It allocates a lot less and sequentially accesses memory.

It's more similar to a solution in Java then Clojure, but it's pretty
readable. It might even be more readable to programmers unfamiliar with
Clojure.

I feel pretty comfortable saying that Clojure is not slow. I did not
even have to disassemble it, tweak anything, or write complicated code.

The gains here are a result of a few actions:
- cutting down on allocation
  - partition -> sliding
  - lazy sequences -> transducers
  - map / filter -> keep
- cutting down on iteration
  - last -> peek
  - juxt / apply -> direct function calls
- Using primitives instead of collections
  - Vectors -> arrays make for faster access
  - Working directly with arrays and contiguous memory access

* Final Scores

Let's take a moment to reflect on how far we've gone

| step       | time (ms) | improvement |  relative |
| baseline   |      1159 |           1 |         1 |
| xf         |       463 |   2.5032397 | 2.5032397 |
| decomposed |       366 |   3.1666667 | 1.2650273 |
| vector     |        88 |   13.170455 | 4.1590909 |
| keep       |        80 |     14.4875 |       1.1 |
| unchecked  |        66 |   17.560606 | 1.2121212 |
| array      |        23 |   50.391304 | 2.8695652 |
| iteration  |     0.655 |   1769.4656 | 35.114504 |
#+TBLFM: @2$3..@>$3=@2$2/$2 
#+TBLFM: @3$4..@>$4=@-1$2/$2


* Should you try this at home?

#+begin_quote
premature optimization is the root of all evil. Yet we should not pass
up our opportunities in that critical 3% -- Donald Knuth
#+end_quote

The answer as always is "it depends"; Things like using ~nth~, ~peek~
and ~pop~ instead of ~first~ and ~last~, using transducers instead of
lazy sequences, and familiarity with Clojure's core (e.g. ~keep~) are
good and will probably produce more idiomatic code. They can be embraced
as habits.

On the other hand, things like writing your own transducers, especially
ones built with Java interop, and working directly with arrays should be
reserved for special circumstances.

Do profile your code first, understand the problems and use cases,
/then/ optimize to your heart's content, secure in the knowledge that if
you need to, Clojure can probably get there.


Happy hacking

