_posts/2021-10-13-fast-and-elegant-clojure.html

<div id="outline-container-orgb051dde" class="outline-2">
<h2 id="orgb051dde">But can we go faster?</h2>
<div class="outline-text-2" id="text-orgb051dde">
<p>
Let us put aside our requirement for idiomatic Clojure. Let's settle on readable.
</p>

<p>
By converting the input to an array, we can work directly with indices
and built up the results collection. We'll also take advantage of the
fact that linked lists are pretty fast to allocate, so build those
instead of a vector or set:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">set!</span> <span style="color: #3a81c3;">*unchecked-math*</span> <span style="color: #4e3163;">true</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">unrolled</span>
  <span style="color: #6c3163;">[</span><span style="color: #655370; background-color: #fbf8ef;">^</span><span style="color: #ba2f59; font-weight: bold;">longs</span> arr<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>l <span style="color: #67b11d;">(</span>unchecked-subtract <span style="color: #b1951d;">(</span>alength arr<span style="color: #b1951d;">)</span> <span style="color: #4e3163;">7</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">loop</span> <span style="color: #67b11d;">[</span>idx <span style="color: #b1951d;">(</span>int <span style="color: #4e3163;">0</span><span style="color: #b1951d;">)</span> agg <span style="color: #b1951d;">()</span><span style="color: #67b11d;">]</span>
      <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>&lt; idx l<span style="color: #b1951d;">)</span>
        <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #3a81c3;">[</span>idx <span style="color: #6c3163;">(</span>int idx<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
          <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">recur</span>
           <span style="color: #6c3163;">(</span>unchecked-inc-int idx<span style="color: #6c3163;">)</span>
           <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>&gt; <span style="color: #4e3163;">1000</span> <span style="color: #887070;">(</span>unchecked-subtract <span style="color: #3a81c3;">(</span>aget arr <span style="color: #6c3163;">(</span>unchecked-add-int idx <span style="color: #4e3163;">7</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>aget arr idx<span style="color: #3a81c3;">)</span><span style="color: #887070;">)</span><span style="color: #2d9574;">)</span>
             <span style="color: #2d9574;">(</span>.cons agg idx<span style="color: #2d9574;">)</span>
             agg<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span>
        agg<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">set!</span> <span style="color: #3a81c3;">*unchecked-math*</span> <span style="color: #4e3163;">false</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>arr <span style="color: #2d9574;">(</span>long-array times-v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">cc</span>/quick-bench <span style="color: #2d9574;">(</span>unrolled arr<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Evaluation count : 912 in 6 samples of 152 calls.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;              </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time mean : 655.284194 &#181;s</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;     </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time std-deviation : 2.846323 &#181;s</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time lower quantile : 651.150750 &#181;s ( 2.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Execution time upper quantile : 658.353038 &#181;s (97.5%)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;                    </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overhead used : 2.066166 ns</span>
</pre>
</div>

<p>
Another 35x speedup!
</p>

<p>
This implementation is very different. It deals with a concrete array
instead of a sequence abstraction, and explicitly builds up the result.
It allocates a lot less and sequentially accesses memory.
</p>

<p>
It's more similar to a solution in Java then Clojure, but it's pretty
readable. It might even be more readable to programmers unfamiliar with
Clojure.
</p>

<p>
I feel pretty comfortable saying that Clojure is not slow. I did not
even have to disassemble it, tweak anything, or write complicated code.
</p>

<p>
The gains here are a result of a few actions:
</p>
<ul class="org-ul">
<li>cutting down on allocation
<ul class="org-ul">
<li>partition -&gt; sliding</li>
<li>lazy sequences -&gt; transducers</li>
<li>map / filter -&gt; keep</li>
</ul></li>
<li>cutting down on iteration
<ul class="org-ul">
<li>last -&gt; peek</li>
<li>juxt / apply -&gt; direct function calls</li>
</ul></li>
<li>Using primitives instead of collections
<ul class="org-ul">
<li>Vectors -&gt; arrays make for faster access</li>
<li>Working directly with arrays and contiguous memory access</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgebdbd09" class="outline-2">
<h2 id="orgebdbd09">Final Scores</h2>
<div class="outline-text-2" id="text-orgebdbd09">
<p>
Let's take a moment to reflect on how far we've gone
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">step</td>
<td class="org-right">time (ms)</td>
<td class="org-right">improvement</td>
<td class="org-right">relative</td>
</tr>

<tr>
<td class="org-left">baseline</td>
<td class="org-right">1159</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">xf</td>
<td class="org-right">463</td>
<td class="org-right">2.5032397</td>
<td class="org-right">2.5032397</td>
</tr>

<tr>
<td class="org-left">decomposed</td>
<td class="org-right">366</td>
<td class="org-right">3.1666667</td>
<td class="org-right">1.2650273</td>
</tr>

<tr>
<td class="org-left">vector</td>
<td class="org-right">88</td>
<td class="org-right">13.170455</td>
<td class="org-right">4.1590909</td>
</tr>

<tr>
<td class="org-left">keep</td>
<td class="org-right">80</td>
<td class="org-right">14.4875</td>
<td class="org-right">1.1</td>
</tr>

<tr>
<td class="org-left">unchecked</td>
<td class="org-right">66</td>
<td class="org-right">17.560606</td>
<td class="org-right">1.2121212</td>
</tr>

<tr>
<td class="org-left">array</td>
<td class="org-right">23</td>
<td class="org-right">50.391304</td>
<td class="org-right">2.8695652</td>
</tr>

<tr>
<td class="org-left">iteration</td>
<td class="org-right">0.655</td>
<td class="org-right">1769.4656</td>
<td class="org-right">35.114504</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgc7e8ef6" class="outline-2">
<h2 id="orgc7e8ef6">Should you try this at home?</h2>
<div class="outline-text-2" id="text-orgc7e8ef6">
<blockquote>
<p>
premature optimization is the root of all evil. Yet we should not pass
up our opportunities in that critical 3% &#x2013; Donald Knuth
</p>
</blockquote>

<p>
The answer as always is "it depends"; Things like using <code>nth</code>, <code>peek</code>
and <code>pop</code> instead of <code>first</code> and <code>last</code>, using transducers instead of
lazy sequences, and familiarity with Clojure's core (e.g. <code>keep</code>) are
good and will probably produce more idiomatic code. They can be embraced
as habits.
</p>

<p>
On the other hand, things like writing your own transducers, especially
ones built with Java interop, and working directly with arrays should be
reserved for special circumstances.
</p>

<p>
Do profile your code first, understand the problems and use cases,
<i>then</i> optimize to your heart's content, secure in the knowledge that if
you need to, Clojure can probably get there.
</p>


<p>
Happy hacking
</p>
</div>
</div>
